{
  "production": [
    {
      "name": "Sup",
      "date": "2/16/26",
      "description": "\"Who's free to hang\" PWA. One-tap broadcasting to your squad with push notifications, real-time map with midpoint calculation, and bar suggestions near the group.",
      "github": "https://github.com/neilkpatel/2_16_26_sup-app",
      "demo": "https://sup-app-jet.vercel.app",
      "tags": ["React", "Supabase", "PostGIS", "Web Push", "PWA", "Leaflet"],
      "icon": "📍",
      "highlights": [
        "Live updates via WebSockets with automatic polling fallback for reliability",
        "Geographic database queries to calculate distances and parse location data",
        "Calculates the geographic center point between all active users",
        "Server-side push notifications with encrypted signing keys",
        "Database-level access control — users only see their own squad's data"
      ]
    },
    {
      "name": "MJ Growth Consulting",
      "date": "1/23/26",
      "description": "Marketing website for a Fortune 100 sales executive's growth advisory practice. Clean, minimal design with image carousel and contact form.",
      "github": "https://github.com/neilkpatel/mjgrowth",
      "demo": "https://mjgrowthconsulting.com",
      "tags": ["HTML/CSS/JS", "Vercel", "Client Work"],
      "icon": "📈",
      "highlights": [
        "Swipe-enabled image carousel with touch gesture detection",
        "Scroll-triggered fade-in animations using Intersection Observer",
        "Dynamic schedule that auto-labels the next upcoming event",
        "Contact form with real-time validation and API submission",
        "Performance-optimized font loading that doesn't block page render"
      ]
    },
    {
      "name": "Horizon Alliance",
      "date": "2/3/26",
      "description": "Alliance hub for Last War: Survival Game. Features event schedules, battle strategies, leadership roster, and alliance lore with a tactical military aesthetic.",
      "github": "https://github.com/neilkpatel/horizon-alliance",
      "demo": "https://horizonalliance.me",
      "tags": ["HTML/CSS/JS", "Vercel", "Gaming", "Community"],
      "icon": "⚔️",
      "highlights": [
        "Live countdown timer that converts between user's timezone and game time",
        "Structured data model for multi-phase battle plans with role assignments",
        "Animated mobile menu with 3D transform transitions",
        "Collapsible FAQ and lore sections with custom expand/collapse styling",
        "Pulsing glow animations on event banners to draw attention"
      ]
    }
  ],
  "experimental": [
    {
      "name": "ATC Radar Game",
      "date": "1/3/26",
      "description": "Air Traffic Control radar simulation game. Vector arrivals to runways, sequence departures, and manage waypoints to keep the skies safe.",
      "github": "https://github.com/neilkpatel/1_3_26_atc_game",
      "demo": "https://1326atcgame.vercel.app",
      "tags": ["TypeScript", "Canvas API", "Vite", "Game Dev"],
      "icon": "✈️",
      "highlights": [
        "Frame-rate-independent game loop — physics work the same at 30fps or 120fps",
        "Aircraft with 6 flight states and realistic turn/climb behavior",
        "Enforces real ATC separation rules in both horizontal and vertical dimensions",
        "Animated radar sweep rendered with Canvas gradients"
      ]
    },
    {
      "name": "News Tracker",
      "date": "1/2/26",
      "description": "Real-time news aggregator tracking latest articles for Adobe, Coal Energy, and GLP-1s with smart ranking and auto-refresh.",
      "github": "https://github.com/neilkpatel/1-2-26-news-tracker",
      "demo": "https://1226newstracker.vercel.app",
      "tags": ["React", "Vite", "Tailwind", "NewsAPI"],
      "icon": "📰",
      "highlights": [
        "Custom ranking algorithm that weighs article freshness and source credibility",
        "Server-side proxy to keep API keys secure and bypass browser restrictions",
        "Boolean search queries (AND/OR) for precise topic matching",
        "15-minute auto-refresh with proper memory cleanup on unmount"
      ]
    },
    {
      "name": "New Year's Countdown 2026",
      "date": "1/1/26",
      "description": "Real-time countdown to New Year's Day with year progress tracker and particle visualization system.",
      "github": "https://github.com/neilkpatel/1-1-26-nye-countdown",
      "demo": "https://1126nyecountdown.vercel.app",
      "tags": ["React", "TypeScript", "Framer Motion", "Tailwind"],
      "icon": "🎆",
      "highlights": [
        "Particle system where elements physically stack on top of each other",
        "Scales from 0 to 4,500 particles proportional to year progress",
        "Layered glass-blur effects with dynamic color-shifting glow",
        "Choreographed entrance animations with staggered timing"
      ]
    },
    {
      "name": "Sports Scores",
      "date": "12/31/25",
      "description": "Live sports scores and game tracking across 17 leagues with intelligent ranking.",
      "github": "https://github.com/neilkpatel/12-31-25-sports-scores",
      "demo": "https://123125sportsscores.vercel.app",
      "tags": ["React", "Vite", "Tailwind"],
      "icon": "🏀",
      "highlights": [
        "Fetches scores from 17 leagues simultaneously using parallel API calls",
        "Ranks games by importance: playoff status, broadcast, team quality, and context",
        "Caps games per league so no single sport dominates the feed",
        "Shows today's games, or falls back to yesterday if nothing's on"
      ]
    },
    {
      "name": "Jackson Hole Snow Tracker",
      "date": "12/28/25",
      "description": "Real-time snow conditions dashboard with vintage split-flap display leaderboard and dynamic snowfall visualization.",
      "github": "https://github.com/neilkpatel/12_28_jackson_hole_snow_tracker",
      "demo": "https://1228jacksonholesnowtracker.vercel.app",
      "tags": ["Vanilla JS", "Canvas API", "Web Scraping", "CSS3"],
      "icon": "⛷️",
      "highlights": [
        "Snowfall animation intensity scales with actual reported snow data",
        "Vintage airport-style split-flap display with 3D flip animations",
        "Scrapes 12 resort websites for live snow data with automatic error recovery",
        "Custom-drawn charts (no charting library) with dynamic axis scaling"
      ]
    }
  ]
}
